/*全局变量*/

var CLOCKDATA =[[[0,0,1,1,1,0,0],[0,1,1,0,1,1,0],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[0,1,1,0,1,1,0],[0,0,1,1,1,0,0]],[[0,0,0,1,1,0,0],[0,1,1,1,1,0,0],[0,0,0,1,1,0,0],[0,0,0,1,1,0,0],[0,0,0,1,1,0,0],[0,0,0,1,1,0,0],[0,0,0,1,1,0,0],[0,0,0,1,1,0,0],[0,0,0,1,1,0,0],[1,1,1,1,1,1,1]],[[0,1,1,1,1,1,0],[1,1,0,0,0,1,1],[0,0,0,0,0,1,1],[0,0,0,0,1,1,0],[0,0,0,1,1,0,0],[0,0,1,1,0,0,0],[0,1,1,0,0,0,0],[1,1,0,0,0,0,0],[1,1,0,0,0,1,1],[1,1,1,1,1,1,1]],[[1,1,1,1,1,1,1],[0,0,0,0,0,1,1],[0,0,0,0,1,1,0],[0,0,0,1,1,0,0],[0,0,1,1,1,0,0],[0,0,0,0,1,1,0],[0,0,0,0,0,1,1],[0,0,0,0,0,1,1],[1,1,0,0,0,1,1],[0,1,1,1,1,1,0]],[[0,0,0,0,1,1,0],[0,0,0,1,1,1,0],[0,0,1,1,1,1,0],[0,1,1,0,1,1,0],[1,1,0,0,1,1,0],[1,1,1,1,1,1,1],[0,0,0,0,1,1,0],[0,0,0,0,1,1,0],[0,0,0,0,1,1,0],[0,0,0,1,1,1,1]],[[1,1,1,1,1,1,1],[1,1,0,0,0,0,0],[1,1,0,0,0,0,0],[1,1,1,1,1,1,0],[0,0,0,0,0,1,1],[0,0,0,0,0,1,1],[0,0,0,0,0,1,1],[0,0,0,0,0,1,1],[1,1,0,0,0,1,1],[0,1,1,1,1,1,0]],[[0,0,0,0,1,1,0],[0,0,1,1,0,0,0],[0,1,1,0,0,0,0],[1,1,0,0,0,0,0],[1,1,0,1,1,1,0],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[0,1,1,1,1,1,0]],[[1,1,1,1,1,1,1],[1,1,0,0,0,1,1],[0,0,0,0,1,1,0],[0,0,0,0,1,1,0],[0,0,0,1,1,0,0],[0,0,0,1,1,0,0],[0,0,1,1,0,0,0],[0,0,1,1,0,0,0],[0,0,1,1,0,0,0],[0,0,1,1,0,0,0]],[[0,1,1,1,1,1,0],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[0,1,1,1,1,1,0],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[0,1,1,1,1,1,0]],[[0,1,1,1,1,1,0],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[1,1,0,0,0,1,1],[0,1,1,1,0,1,1],[0,0,0,0,0,1,1],[0,0,0,0,0,1,1],[0,0,0,0,1,1,0],[0,0,0,1,1,0,0],[0,1,1,0,0,0,0]],[[0,0,0,0],[0,0,0,0],[0,1,1,0],[0,1,1,0],[0,0,0,0],[0,0,0,0],[0,1,1,0],[0,1,1,0],[0,0,0,0],[0,0,0,0]]];

//绘制的分辨率
var winWidth  = 1024;
var winHeight = 768;
document.getElementById("cv").style.width = winWidth+"px";

//用于储存时间
var curTimeSec = 0;

//储存小球类
var balls      = [];
//var ballColor  = ["#009EFC","#00B8FB","#0CD3FA","#F94BA2","#568F62","#B29947","#EF731D","#E1594B","#747762"];

//小球半径，同时会修改时钟大小
var radius     = Math.round((winWidth * 8 / 10) / 96)-1;

//时钟的位置
var numStyle = {
        top:2*(radius+1)*6,
        left:Math.round(winWidth/12),
        moveRight:2*(radius+1)
    };

//刷新率，影响动画的帧数，过高卡顿，过低速度过快，推荐16.67
var refreshRate = 16.67;

//绘制小球的最大数量，过大影响性能，过小影响效果，推荐353|421|563
var ballsCache = 353;

//定义小球的初速
var V = {
	xMax: 8,
	xMin: 0.618,
	yMax: 10,
	yMin: 0.382
};


//定义重力加速度
/*------------*/


/*---------------*/


/*定制小球的运动属性
var ballAttributs = {
xMAX:50,
xMIN:0.618,
xRandom: Math.pow(-1, Math.ceil(Math.random()*11)) * (Math.random()*(this.xMAX-this.xMIN)+this.xMIN),

yMAX:10,
yMIN:0.168,
yRandom: Math.pow(-1, Math.ceil(Math.random()*11)) * (Math.random()*(this.yMAX-this.yMIN)+this.yMIN),

//随机x轴速度
vx: this.xRandom,
//随机y轴速度
vy: this.yRandom,

//随机小球质量
g: Math.random()*(0.618-0.382)+0.382
}*/


/*小球类构造函数，有默认参数，需配合updateBalls()函数才能产生动画*/
function ball(x, y, color, vx, vy, g) {
    this.alterVYXMaxMin = alterVYXMaxMin;

    //随机化x轴速度
    this.vxMAX = 10;
    this.vxMIN = 0.618;
	this.vxRandom = Math.pow(-1, Math.ceil(Math.random()*11)) * (Math.random()*(this.vxMAX-this.vxMIN)+this.vxMIN);
	
	//随机化y轴速度
	this.vyMAX = 10;
	this.vyMIN = 0.618;
	this.vyRandom = Math.pow(-1, Math.ceil(Math.random()*11)) * (Math.random()*(this.vyMAX-this.vyMIN)+this.vyMIN);
    
    this.x = x || 100;
    this.y = y || 100;
    this.color = color || "#8A1515";

    /*Math.pow(-1, Math.ceil(Math.random()*11))随机生成正负值1*/
    this.vx = vx || this.vxRandom;
    this.vy = vy || this.vyRandom; 
    this.g = g || Math.random()*(0.618-0.382)+0.382;

    
}

function alterVYXMaxMin(vxMAX ,vxMIN ,vyMAX ,vyMIN) {
	this.vxMAX = vxMAX;
	this.vxMIN = vxMIN;
	this.vxRandom = Math.pow(-1, Math.ceil(Math.random()*11)) * (Math.random()*(vxMAX-vxMIN)+vxMIN);

	this.vyMAX = vyMAX;
	this.vyMIN = vyMIN;
	this.vyRandom = Math.pow(-1, Math.ceil(Math.random()*11)) * (Math.random()*(vyMAX-vyMIN)+vyMIN);

	this.vx = this.vxRandom;
	this.vy = this.vyRandom;
}


